{
    "todos": [
        {
            "completed": false,
            "title": "",
            "id": 1
        }
    ],
    "posts": [
        {
            "id": 1,
            "title": "Hướng dẫn chi tiết cách sử dụng dev mode trong khóa Pro",
            "excerpt": "Chào bạn! Nếu bạn đã là học viên khóa Pro của F8, chắc hẳn bạn đã biết tới \"Dev Mode\" - giúp thực hành code song song khi xem video (bạn không cần phải dùng tới VS code nữa).",
            "content": "Chào bạn! Nếu bạn đã là học viên khóa Pro của F8, chắc hẳn bạn đã biết tới \"Dev Mode\" - giúp thực hành code song song khi xem video (*bạn không cần phải dùng tới VS code nữa*).\n\n## I. Giới thiệu Dev Mode\n\n### 1.1 Dev Mode hữu ích khi học kiến thức mới\n\n*Dev Mode* cực kỳ hữu ích khi bạn học các kiến thức mới, nó giúp bạn trải nghiệm thực tế luôn, thay vì chỉ xem video đơn thuần như hầu hết các khóa học khác.\n\n![image.png](https://files.fullstack.edu.vn/f8-prod/blog_posts/8333/64f0031f9f336.png)\n*Bên trái là bài học video, bên phải là trình viết code và browser hỗ trợ live reload.*\n\nỞ hình ảnh trên, mình vừa có thể học kiến thức mới về *Grid CSS*, vừa có thể tự tay trải nghiệm cách hoạt động của nó.\n\n### 1.2 Dev mode hỗ trợ đa ngôn ngữ\n\nDev Mode hỗ trợ đầy đủ các ngôn ngữ khác nhau, tùy thuộc vào nội dung bài học đang sử dụng ngôn ngữ nào.\n\nHỗ trợ Sass - Ngôn ngữ tiền xử lý CSS, hỗ trợ \"Auto compile\":\n\n![image.png](https://files.fullstack.edu.vn/f8-prod/blog_posts/8333/64f0050f31465.png)\n*Bạn có thể viết Sass trực tiếp trong trình duyệt, quá trình biên dịch diễn ra tự động.*\n\nHỗ trợ Javascript:\n\n![image.png](https://files.fullstack.edu.vn/f8-prod/blog_posts/8333/64f008718cdf5.png)\n\n*Tùy vào nội dung bài học, Dev Mode sẽ linh hoạt thay đổi ngôn ngữ để đáp ứng nhu cầu trải nghiệm một cách tốt nhất.*\n\n---\n\n## II. Cách sử dụng Dev Mode hiệu quả\n\n### 2.1 Cách bật Dev Mode\n\nDev Mode chỉ hỗ trợ bài học video. Trên Header, bạn nhấn vào biểu tượng sau để bật Dev Mode:\n\n![image.png](https://files.fullstack.edu.vn/f8-prod/blog_posts/8333/64f00b6da9f09.png)\n*Trong Dev Mode, bạn vừa có thể học qua video, vừa thực hành code.*\n\n### 2.2 Phải thành thạo cú pháp để sử dụng\n\nDev Mode không hỗ trợ gợi ý, bắt buộc bạn phải thành thạo cú pháp.\n\n> ***Theo mình, khi mới học tập thì thành thạo cú pháp là một trong những yếu tố quan trọng nhất. Tự gõ toàn bộ là cách duy nhất giúp bạn thành thạo cú pháp.***\n\nDev Mode có hỗ trợ Emmet:\n\n![image.png](https://files.fullstack.edu.vn/f8-prod/blog_posts/8333/64f00bf4267f9.png)\n\nKết quả sau khi nhấn *Tab*:\n\n![image.png](https://files.fullstack.edu.vn/f8-prod/blog_posts/8333/64f00c106e3b2.png)\n\nHoặc viết *CSS* thế này:\n\n![image.png](https://files.fullstack.edu.vn/f8-prod/blog_posts/8333/64f00c522259e.png)\n\nKết quả là:\n\n![image.png](https://files.fullstack.edu.vn/f8-prod/blog_posts/8333/64f00c60c43b0.png)\n\n> ***Các bạn học Emmet tại đây: https://docs.emmet.io/cheat-sheet/. Lưu ý là không cần học tất cả, khi cần cái nào thì vào tra cứu cái đó. Lâu dần bạn sẽ thuộc hết những Emmet thường dùng, vậy là đủ.***\n\n### 2.3 Giảm tốc độ video hoặc pause khi cần thiết\n\nKhi video đang phát, nếu bạn chưa thành thạo cú pháp thì rất khó để gõ code theo kịp. Vì vậy, các bạn cần phải:\n1. Giảm tốc độ video hoặc pause video. Gõ lại các dòng code và trải nghiệm\n2. Luyện tập thêm thật nhiều để thành thạo cú pháp code, cú pháp Emmet\n3. Hãy tự tò mò thêm, tự sửa code để xem nó chạy như thế nào\n\n> ***Tò mò, tự khám phá/tự trải nghiệm là điều kiện tiên quyết để trở thành một kỹ sư tài giỏi trong tương lai***.\n\n---\n\n### III. Tổng kết\n\nDev Mode là công cụ rất mạnh giúp bạn học tập tốt hơn thông qua trải nghiệm song song cùng với xem video. Tuy nhiên, bạn phải thành thạo cú pháp code để Dev Mode thực sự phát huy sức mạnh.\n\nCác khóa học Pro hiện tại của F8 (hỗ trợ rất nhiều tính năng hiện đại mà các nền tảng khác không có):\n\n1. Khóa học HTML CSS Pro: https://fullstack.edu.vn/landing/htmlcss/\n2. Khóa học ngôn ngữ Sass: https://fullstack.edu.vn/landing/sass/\n3. Các khóa học khác, tìm hiểu thêm tại trang chủ F8: https://fullstack.edu.vn/\n\n*Have a nice day 🙌. See you!*",
            "thumbnail_url": "https://files.fullstack.edu.vn/f8-prod/blog_posts/8334/64f01064b0724.png",
            "user": {
                "name": "Sơn Đặng",
                "avatar_url": "https://files.fullstack.edu.vn/f8-prod/user_avatars/1/64f9a2fd4e064.jpg",
                "is_pro": true
            }
        },
        {
            "id": 2,
            "title": "Cảm thấy khó khăn khi chuyển sang học một ngôn ngữ mới",
            "excerpt": "Cảm thấy khó khăn khi chuyển sang học một ngôn ngữ mới",
            "content": "Tôi làm chuyên môn về phân tích dữ liệu, chủ yếu là dùng phần mềm chuyên môn sâu và dùng rất nhiều SQL db, python. Hai món đó cũng đủ để dùng và phát triển. Tuy nhiên, xu hướng mới là webapp nên tôi phải cung cấp tool, giao diện người dùng... thông qua đó. Phải nói rất tốt cho công việc chung.\r\n\r\nNền tảng tôi dùng đã cung cấp sẵn các công cụ để xây dựng app dựa trên các widget có sẵn với khả năng tùy biến nhất định. Tuy nhiên, nhu cầu của người dùng và đặc thù công việc là vô cùng phong phú. Vì vậy, nền tảng cũng cung cấp cho SDK để phát triển widget để nhồi vào app. Yêu cầu dùng TypeScript và React. Mục tiêu là viết các widget có thể \"nói chuyện\" với nhau, truyền thông tin, propertíes qua lại lẫn nhau.\r\n\r\nTiếc là tài liệu và bài học về SDK của nền tảng hoặc quá sơ sài, mặc định người dùng biết hết rồi, hoặc rời rạc do bản thân React cũng đã thay dổi, updata...\r\n\r\nMình thấy hoa cả mắt khi nhìn thấy cấu trúc file pack trong một dự án, rồi file này nối sang file kia. Bản thân mình rất quen thuộc với việc viết module trên python, nhưng đúng là chạm vào thế giới JS thấy có vẻ phức tạp hơn.\r\n\r\nXem một số bài học của F8 thấy ít nhất là có giải thích cho người ta hiểu cái gì là cái gì, tại sao như vậy rồi nó làm việc ra sao. Quyết định đăng ký học để xem liệu mình có hiểu để viết được widget trên SDK nền tảng của mình ko.\r\n\r\nCó tuổi rồi, học gì cũng ngại...",
            "thumbnail_url": null,
            "user": {
                "name": "Alan King",
                "avatar_url": "https://files.fullstack.edu.vn/f8-prod/user_photos/323800/6464902b20c91.jpg",
                "is_pro": false
            }
        },
        {
            "id": 3,
            "title": "Bạn đã biết cách đưa trang web của mình lên github",
            "excerpt": "Bạn đã biết cách đưa trang web của mình lên github",
            "content": "Chắc hẳn nhiều bạn sau khi đã thành công tạo một website từ những kiến thức học được từ khóa học lập trình tại F8 và cảm thấy đó là một bước khởi đầu khởi sắc của bản thân và điều đó thật tuyệt và bạn muốn chia sẻ điều đó để mọi người cùng tham khảo và đánh giá sản phẩm đầu tay của bạn. Để làm điều đó thì có rất nhiều cách để bạn có thể đẩy có thể tạo ra đường link liên kết tới trang web của bạn. Nhưng để dễ dàng với mục đích lưu trữ code và tạo link cho web bạn thì mình lựa chọn github để thực hiện.\n\n-Để có thể làm được điều đó chúng ta cần tải phần mềm git pash để thực hiện các câu lệnh đẩy code lên github\n![image.png](https://files.fullstack.edu.vn/f8-prod/blog_posts/5917/63a4a88fd5931.png)\nđây là đường link để tải: https://git-scm.com/downloads\nsau khỉ tải và giải nén thì chúng ta mở git pash lên:\n![image.png](https://files.fullstack.edu.vn/f8-prod/blog_posts/5917/63a4a92f688b7.png)\nvà nó sẽ có giao diện như thế này!\n-Để có thể lưu trữ code thì chúng ta cần tạo một new project mới trên github (tại new button)\n![image.png](https://files.fullstack.edu.vn/f8-prod/blog_posts/5917/63a4a99e2849e.png)\nvà sau đó nhập tên dự án của bạn và nhấn ** Create repository** để tạo\nvà bạn sẽ nhận được một liên kết http có dạng \"https://github.com/yourAccount/projectName.git\"\nvd\" \"https://github.com/cuongTran/shopping.git\"\n\n-Bạn sẽ mở git pash và thực hiện câu lệnh: git clone liên kết bạn nhận được\nvd:          $ git clone https://github.com/cuongTran/shopping.git\nthành công nó sẽ hiện lên cảnh báo bạn đã được tạo 1 folder\n\nwarning: You appear to have cloned an empty repository.\n\n-Sau đó một folder sẽ được tạo trong máy tính của bạn và nó sẽ có một file  .git trong máy của bạn\n\n-Bạn sẽ đưa tất cả các file liên quan tới code của bạn như index.html, css.style, app.js vào trong folder này\n\n-Bạn sẽ copy đường dẫn tới folder đó và paste vao git pash và đổi dấu \\ thành dấu '/' và ENTER\n\n-Tiếp theo bạn nhập câu lệnh (có dấu cách giữa add và dấu chấm) :  git add .\n\n-Tiếp theo là câu lệnh cuối để đẩy code lên: git push\n\n-Bạn sẽ chờ nó load 100% để hoàn thành\nSau đó bạn chờ trong vài giây và load lại trang github hiện tại và thấy các file của bạn đã hiện thì trên dự án bạn tạo\n*Để có được đường link liên kết tới web của bạn:\n\n-nhấn vào biều tượng setting (hình răng cưa)\n\n-nhấn vào mục \"Page\" bên thanh nav trái \n![image.png](https://files.fullstack.edu.vn/f8-prod/blog_posts/5917/63a4aec4442e9.png)\nVà chuyển \"Branch\" sang main folder/(root) và Save\nchờ khoảng tầm 1 phút thì bạn load lại trang và đường link của bạn sẽ được liên kết thành công!\nvideo các bước thực hiện: https://www.youtube.com/watch?v=yUNGk-uP1Lk\n\nBạn sẽ gửi thành quả của mình đến mọi người và chia sẻ nó, đó là quá trình học tập và làm việc của bạn. Chúc các bạn thành công!",
            "thumbnail_url": "https://files.fullstack.edu.vn/f8-prod/blog_posts/5918/63a4b3ff73341.jpg",
            "user": {
                "name": "Cường Trần",
                "avatar_url": "https://files.fullstack.edu.vn/f8-prod/user_avatars/123041/64512843889dd.jpg",
                "is_pro": false
            }
        },
        {
            "id": 4,
            "title": "Các nguồn tài nguyên hữu ích cho 1 front-end developer",
            "excerpt": "Các nguồn tài nguyên hữu ích cho 1 front-end developer",
            "content": "![39-frontend.jpg](https://files.fullstack.edu.vn/f8-prod/blog_posts/107/613a1e8d8fc47.jpg)\n###  1. Trình soạn thảo code \n[![https://codingheroes.io/resources/img/logos/vscode.png](https://codingheroes.io/resources/img/logos/vscode.png)](https://code.visualstudio.com/)\n> Visual studio code: là 1 trình soạn thảo code được nhiều người sử dụng nhất hiện nay với khả năng code được nhiều ngôn ngữ và rất nhiều extension hổ trợ cho việc code\n\n\n### 2. Nguồn học HTML, CSS, JS,...\n[W3School](https://www.w3schools.com/)\n> W3School: là 1 trang web học code miễn phí đang tin cậy với nhiều bài giảng chất lượng có đầy đủ cả lý thuyết lận thực hành với nhiều bài code mẫu ngay sau những kiến thức lý thuyết cực kỳ trực quan.\n\n[MDN Web Docs](https://developer.mozilla.org/en-US/)\n> MDN Docs: như một kho thư viện định nghĩa các thuộc tính, chức năng và cách sử dụng của các thẻ, hàm, câu lệnh... của các ngôn ngữ như HTML, CSS, Javascript,... vô cùng đầy đủ và chính xác\n\n\n#### Và 1 số trang web khác như: \n- [CSS-Trick](https://css-tricks.com/)\n- [Stack Overflow](https://stackoverflow.com/)\n- [F8](https://fullstack.edu.vn/)\n- ...\n### 3. Nguồn chứa các font chữ thường hay được sử dụng:\n- [Google Font](https://fonts.google.com/)\n- [Fontsquirrel](https://www.fontsquirrel.com/)\n- [Myfont](https://www.myfonts.com/)\n### 4. Nguồn chứa các màu sắc thường hay được sử dụng:\n- [Tailwind Colors](https://tailwindcss.com/docs/customizing-colors)\n- [Coolors Contrast Checker](https://coolors.co/contrast-checker/112a46-acc8e5)\n- [Flat UI Colors](https://flatuicolors.com/)\n- [Colorhunt Palettes](https://www.colorhunt.co/)\n### 5. Nguồn chứa các kho ảnh trực tuyến thường hay được sử dụng:\n- [Unsplash](https://unsplash.com/)\n- [Pexels](https://www.pexels.com/vi-vn/)\n- [unDraw](https://undraw.co/illustrations)\n- [Pixaby](https://pixabay.com/)\n### 6. Nguồn chứa các Icon thường hay được sử dụng:\n- [Font Awesome](http://fontawesome.io/)\n- [Ionicons](https://ionic.io/ionicons)\n- [Icons8](https://icons8.com/)\n- [Hero Icons](https://heroicons.com/)\n### 7. Nguồn chứa các mẫu design đẹp thường hay được sử dụng:\n- [Dribbble](https://dribbble.com/)\n- [Land Book](https://land-book.com/)\n- [One Page Love](https://onepagelove.com/inspiration)\n- [Screelane](https://screenlane.com/)",
            "thumbnail_url": "https://files.fullstack.edu.vn/f8-prod/blog_posts/107/613a1f36eed00.png",
            "user": {
                "name": "Vương Dương",
                "avatar_url": "https://graph.facebook.com/547825429409669/picture?width=400&height=400",
                "is_pro": true
            }
        },
        {
            "id": 5,
            "title": "Thời gian và Động lực",
            "excerpt": "Thời gian và Động lực",
            "content": "Có lẽ cũng rất lâu rồi mà tôi chưa đụng đến thứ được gọi là \"timetable\". Hay dân dã hơn thì người ta hay gọi là \"Lịch thường nhật\", còn đối với học sinh, sinh viên gọi là \"thời khóa biểu\".  Chắc hẳn nhiều người sẽ thắc mắc tại sao tôi là sinh viên mà lại lâu rồi chưa đụng đến cái mà sinh viên đều gọi là thời khóa biểu. Đương nhiên học sinh hay sinh viên đều cần có nó để xem lịch học, để không một buổi sáng nào bị quên mất kiến thức.\n\nTrong bài viết này, ý tôi muốn nói là \"timetable\" hay là cách sắp sếp thời gian cho từng môn học hoặc việc gì đó ghi chi chít trên một bảng lịch. Đến tận bây giờ tôi mới học được cách sắp xếp thời gian, phân chia từng môn học theo lịch học trên trường. \nKhi chúng ta còn trẻ còn sức khỏe còn học tập và lao động thì thời gian là thứ vô cùng quan trọng nếu như chúng ta biết sắp xếp và phân bổ hợp lý thì sẽ kiểm soát được nó, thay vì chúng ta muốn học một cái gì đó mà cứ than vãn rằng: \"*Thôi chắc không có thời gian để học đâu*\" hay kiểu thấy một khóa học dài thì lại than: \"*Haizz.... Học khóa này lâu thế. Tốn thời gian*\" thì các bạn đang cố tìm kiếm biện minh cho sự lười biếng của các bạn mà thôi, có thể dành vài tiếng đồng hồ ra chơi game, lướt facebook, tiktok mà bỏ mấy phút ra học thì lại không làm được và cố tỏ ra mình là người bận rộn. Đó là chẳng qua chưa kiểm soát được thời gian nên sẽ có tình trạng lúc thì làm rất nhiều việc nhưng lại có lúc mất cân bằng chả muốn làm gì cả, làm một việc là ngại không muốn làm. Đặc biệt chúng ta trong thời gian tự học thì càng cần phải kiểm soát được nó như một cái gì đấy làm động lực giúp ta học hỏi thêm nhiều thứ hay ho hơn.\n\n Thế nhưng tôi lại không phải là kiểu người sống rập khuôn, là kiểu người khi thấy một cành cây khô nhô ra khỏi lề đường cũng khiến tôi đứng sững người mười lăm phút. . Lề thói với tôi, nói chung là không có tác dụng, khi mà Hà Nội vốn luôn khiến tôi bất ngờ đến đứng sững. \n\nĐương nhiên, càng trưởng thành thì người ta lại càng bó buộc mình lại theo một khuôn khổ. Nó giúp chúng ta làm được tốt những điều người khác muốn, đạt được những thứ mà người khác kỳ vọng theo cách đơn giản hơn. Một chương trình tốt là một chương trình được lập trình sẵn theo cách kỹ càng, tính toán được nhiều biến số... Tôi vốn làm chủ được cuộc đời mình và sống theo cách của tôi, một cách là người đời chưa thể hiểu rõ hơn được. Tuy nhiên, lớn rồi người ta sẽ phải chấp nhận đánh đổi nhiều thứ để đạt được những thứ mà mình muốn, đạt được trong tương lai. Có lẽ từ mai tôi sẽ phải tìm cách cân bằng lại cỗ máy thời gian của mình và một lịch trình làm việc và tự học hiệu quả hơn. \n\nMột số ứng dụng,  cách giúp tôi lấy lại động lực để cố gắng tự học, làm việc vượt qua trong khoảng thời gian dịch bệnh căng thẳng (Đây là suy nghĩ của tôi chia sẻ thôi nha nếu như các bạn có cách nào hay thì hãy comment bên dưới để cho tôi và mọi người cùng biết với nha :)) ) khi tất cả đều chuyển sang online. Các bạn biết tại sao khi chúng ta học trên trường học online lại chăm hơn khi chúng ta tự học? Đó là lí do những thứ chúng ta gọi là ràng buộc mình về mọi thứ ví dụ như: thầy cô hoặc điểm số chẳng hạn,... \n\n**Vậy thì**:\n\n1. Các bạn hãy coi một khóa học online trên trang học trực tuyến hay youtube như là một môn học chuyên ngành trên trường và đang học online, người làm video hướng dẫn như người thầy, người cô của tôi vậy như thế sẽ giúp mình có động lực học  hơn.\n2. Các bạn có thể rủ bạn bè hay một nhóm bạn thân nào đấy tạo phòng meet hay rủ nhau vào Discord rồi tạo cho mình một không gian như trong buổi học online.\n3. Hãy nghe một bản nhạc lofi để giúp các bạn lấy lại tinh thần và động lực cho bản thân khi tự học.\n\n**Và để sắp xếp lịch học thì các bạn xem qua**:\n\n- Google Calendar (hoàn toàn Free và luôn đồng bộ với nhiều thiết bị. Đồ ngon thế tội gì mà không dùng :v )\n- Trello (1 ứng dụng todo list giúp phân chia tasks để các bạn có thể cong mông lên mà chạy deadline). Ứng dụng này nhìn có vẻ giống app Todolist của Microsoft. Tuy nhiên mỗi một ứng dụng sẽ có 1 tính năng nổi trội riêng và tùy theo cách sử dụng của mỗi người nên thấy cái nào dễ dùng và quen sử dụng thì dùng thôi.\n\nTuy nhiên cách sắp xếp và phân bố thời gian của mỗi người là khác nhau nên cũng không thể phải áp đặt thời gian của người khác lên cách sinh hoạt và cuộc sống của mình được, hãy sắp xếp làm sao để có thế nghỉ ngơi và một tinh thần thoải mái để chào đón một ngày mới và làm việc trở nên tốt hơn.\n\n![wepik-20211113-01332.png](https://files.fullstack.edu.vn/f8-prod/blog_posts/1671/61b634151fbbb.png)",
            "thumbnail_url": "https://files.fullstack.edu.vn/f8-prod/blog_posts/1671/61b6368a3a089.jpg",
            "user": {
                "name": "Đông Ngô",
                "avatar_url": "https://files.fullstack.edu.vn/f8-prod/user_avatars/9143/6263caafdf588.jpg",
                "is_pro": false
            }
        },
        {
            "id": 6,
            "title": "Rèn luyện tư duy và áp dụng kiến thức đã học vào thực hành",
            "excerpt": "Rèn luyện tư duy và áp dụng kiến thức đã học vào thực hành",
            "content": "Mình có đọc qua vài bình luận ở dưới một số video trong khóa JS cơ bản và thấy một số bạn muốn có thêm bài tập thực hành (cụ thể là phần mảng/array và vòng lặp/loop), ngoài ra mình thấy khóa đó anh Sơn cũng chưa nói nhiều về phương pháp tư duy cũng như  thuật toán nên mình muốn chia sẻ tới các bạn một số keyword để research cũng như thực hành để cải thiện kỹ năng bản thân (ngoài ra cũng test luôn chức năng viết blog xD trên F8)\n\n* Tìm hiểu **bigO notation** là gì ?\n* Swap element in array\n* Find max, min in array (with loop)\n* **Linear search** (optimal lieaner search - hay linear search with wall)\n* **Cơ bản**: insertion sort, selection sort, bubble sort..\n* **Nâng cao**: quick sort, merge sort, heap sort..\n* *tìm hiểu thêm: sắp xếp mảng răng cưa, mảng 2 chiều..*\n* sắp xếp xong thì tìm kiếm nhị phân (**binary search**)\n* Nâng cao tư duy bằng các thuật toán/ cách tiếp cận bài toán như **greedy** algorithm, **divide and conquer**, **backtracking**,... và các bài toán n-queen problem, knapsack problem...\n\nBài tập và lý thuyết có thể tìm trên [w3school](https://www.w3schools.in/data-structures/intro),[ geeksforgeeks](https://www.geeksforgeeks.org/0-1-knapsack-problem-dp-10/) hoặc trên youtube (recommend: [Abdul Bari](https://www.youtube.com/channel/UCZCFT11CWBi3MHNlGf019nw) - ông chú ấn độ uy tín khỏi bàn))), \n\nVề sách thì có mình đang đọc quyển [algorithm grokking](https://www.google.com/search?q=algorithm+grokking&source=lmns&bih=969&biw=1920&rlz=1C1BNSD_viRU979RU979&hl=vi&sa=X&ved=2ahUKEwjmlIHt2sD3AhWJp4sKHaIEBWoQ_AUoAHoECAEQAA) (chuyên về thuật toán, gồm psuedo code và hình ảnh, các tiếp cận dành cho người người mới bắt đầu nên cực dễ hiều, chỉ cần biết một số từ vựng tiếng anh là được) và [javascript the definitive guide](https://www.google.com/search?q=javascript+the+definitive+guide&rlz=1C1BNSD_viRU979RU979&oq=javascript+the+definitive+guide&aqs=chrome..69i57j0i512l2j0i22i30l2j69i60l3.4940j0j9&sourceid=chrome&ie=UTF-8) để hiều thêm về JS\n\nNhững điều mình chia sẻ bên trên là những gì mình được học ở cấu trúc bài giảng ở đại học, nên các bạn có thể tin tưởng nhé. Mình cũng triển khai thử binary search với bubble sort thấy nó bao quát được khá nhiều, bao gồm cả vòng lặp while, for, làm việc với mảng.. (và debug mệt nghỉ)))\n\nChúc các bạn học tập vui vẻ, và cảm ơn anh Sơn vì khóa học rất hữu ích !!!",
            "thumbnail_url": "https://files.fullstack.edu.vn/f8-prod/blog_posts/3370/626fc1a91b92a.png",
            "user": {
                "name": "Nam Vũ",
                "avatar_url": "https://files.fullstack.edu.vn/f8-prod/user_avatars/82209/627c00e9e0f47.jpg",
                "is_pro": false
            }
        },
        {
            "id": 7,
            "title": "Tại sao nên thêm rel=\"noopener\" khi sử dụng target=\"_blank\"?",
            "excerpt": "Tại sao nên thêm rel=\"noopener\" khi sử dụng target=\"_blank\"?",
            "content": "Như chúng ta đã biết, sử dụng `target=\"_blank\"` cho thẻ `a` thì khi người dùng click vào liên kết trình duyệt sẽ mở trên một tab mới, thường là do liên kết trong thẻ `a` dẫn tới một website khác và chúng ta không muốn người dùng rời khỏi website của mình.\n\n---\n\n## Vấn đề là gì?\nVới cách làm trên có 2 vấn đề về bảo mật và hiệu suất:\n\n1. Tại trang đích có thể sử dụng `window.opener` để kiểm soát được cửa sổ trang gốc của chúng ta, ví dụ chạy `window.opener.location.href = 'https://fullstack.edu.vn/'` là có thể chuyển hướng cửa sổ gốc tới `https://fullstack.edu.vn/`. Hãy tưởng tượng bạn bị chuyển tới một URL có nội dung \"độc hại\" như 18+ (khi ngồi cạnh người yêu), hay các trang giả mạo để đánh cắp tài khoản ngân hàng, thông tin cá nhân, v.v...\n2. Trang đích chạy cùng tiến trình xử lý Javascript với trang gốc, nếu trang đích sử dụng nhiều logic \"nặng\" hoặc tối ưu chưa tốt về mặt hiệu năng có thể làm ảnh hưởng tới trang web của bạn đang được mở tại cửa sổ gốc.\n\n---\n\n## Khắc phục thế nào?\n\nĐể khắc phục vấn đề trên, bạn hãy thêm `rel=\"noopener\"` vào toàn bộ các thẻ `a` có `target=\"_blank\"` nhé. Ví dụ:\n\n```html\n<a href=\"https://fullstack.edu.vn/\" target=\"_blank\" rel=\"noopener\">Học lập trình tại F8</a>\n```\n\n> Bạn cũng có thể sử dụng `rel=\"noreferrer\"` thay cho `rel=\"noopener\"` tuy nhiên không được khuyến nghị vì `noreferrer` sẽ làm cho trang đích không thể biết người dùng tới từ nguồn nào, điều này có thể ảnh hưởng tới kết quả phân tích, thống kê truy cập của trang đích.\n\n---\n\nTham khảo: https://web.dev/external-anchors-use-rel-noopener/",
            "thumbnail_url": "https://files.fullstack.edu.vn/f8-prod/blog_posts/1355/619482df77279.jpg",
            "user": {
                "name": "Sơn Đặng",
                "avatar_url": "https://files.fullstack.edu.vn/f8-prod/user_avatars/1/64f9a2fd4e064.jpg",
                "is_pro": true
            }
        },
        {
            "id": 8,
            "title": "Xử lý bất đồng bộ trong Javascript - Phần 2",
            "excerpt": "Xử lý bất đồng bộ trong Javascript - Phần 2",
            "content": "### **3.3 Async/await (ES7)**\n\n\nAsync/await là cơ chế giúp bạn thực thi các thao tác bất đồng bộ một cách tuần tự hơn , giúp đoạn code nhìn qua tưởng như đồng bộ nhưng thực ra lại là chạy bất đồng bộ, giúp chúng ta dễ hình dung hơn.\n\n**3.2.1 Async**\n\nĐể định nghĩa một hàm bất đồng bộ với async, ta cần khai báo từ khóa async ngay trước từ khóa định nghĩa hàm.\n\nRegular function:\n\n```\nasync function getUser() {\n    return ...\n}\n```\n\nFunction expression:\n```\ngetUser = async function() {\n    return ...\n}\n```\n\nKết hợp với cú pháp arrow function của ES6\n```\ngetUser = async () => { ... }\n```\nGiá trị trả về của *AsyncFunction* sẽ luôn là một *Promise * mặc cho bạn có gọi *await* hay không, nếu trong code không trả về *Promise* nào thì sẽ có một promise mới được resolve với giá trị lúc đầu (nếu không có giá trị nào trong return kết quả trả về sẽ là undefine). *Promise* này sẽ ở trạng thái thành công với kết quả được trả về qua từ khóa return của hàm async, hoặc ở trạng thái thất bại với kết quả được đẩy qua từ khóa throw trong hàm async.\n\n**3.1.2 Await**\n\nVề cơ bản thì *await* giúp cho cú pháp trông dễ hiểu hơn, thay thì phải dùng *then()* nối tiếp nhau thì chỉ cần đặt await trước mỗi hàm mà chúng ta muốn đợi kết quả của thao tác bất đồng bộ. Chỉ dùng được *await* trong hàm nào có async đứng phía trước.\n\n**Tài liệu tham khảo:**\n\nhttps://freelancervietnam.vn/async-await-ho-tro-javascript-code-dong-bo-don-gian/\nhttps://techmaster.vn/posts/34304/6-ly-do-asyncawait-danh-bai-promises\nhttps://toidicodedao.com/2016/07/05/javascript-promise/",
            "thumbnail_url": "https://files.fullstack.edu.vn/f8-prod/blog_posts/1069/617946ecf0f63.jpg",
            "user": {
                "name": "Nguyên Đinh",
                "avatar_url": "https://files.fullstack.edu.vn/f8-prod/user_avatars/6061/63f0e31d4b28d.jpg",
                "is_pro": false
            }
        }
    ]
}
